{
  "designTools": [{
      "src": "images/ps.png",
      "title": "Photoshop"
    },
    {
      "src": "images/indesign.png",
      "title": "InDesig"
    },
    {
      "src": "images/sketch.png",
      "title": "Sketch"
    },
    {
      "src": "images/invisionStudio.png",
      "title": "Invision Studio"
    }
  ],
  "designFamiliar": [{
      "src": "images/lightroom.png",
      "title": "Lightroom"
    },
    {
      "src": "images/invision.png",
      "title": "Invision"
    },
    {
      "src": "images/analytics.png",
      "title": "Analytics"
    },
    {
      "src": "images/wp.png",
      "title": "Wordpress"
    }
  ],
  "designSkills1": {
    "0": "Wireframes",
    "1": "Prototypen",
    "2": "High-Res Mockups",
    "3": "Dokumentation"
  },
  "designSkills2": {
    "0": "Interface Design",
    "1": "Webdesign",
    "2": "App-Design",
    "3": "Styleguides"
  },
  "dCanDo1": {
    "0": "Web-Werbemittel",
    "1": "Druck-Werbemittel",
    "2": "Produktfotos",
    "3": "Fotobearbeitung"
  },
  "dCanDo2": {
    "0": "Visitenkarte",
    "1": "Druckprodukte"
  },
  "designProjects": [{
      "src": "images/real.png",
      "title": "real.de",
      "project": "dProject1"
    },
    {
      "src": "images/rf.png",
      "title": "REWE Foto",
      "project": "dProject2"
    },
    {
      "src": "images/moment.png",
      "title": "Der Moment",
      "project": "dProject3"
    },
    {
      "src": "images/mf.png",
      "title": "meinfoto.de",
      "project": "dProject4"
    }
  ],
  "dProject1": {
    "title": "real.de Website",
    "text": {
      "0": "Die real.de Website besteht aus vier verschiedenen Services. Meine Aufgaben bezogen sich innerhalb dieses Projektes auf den Marktplatz. Hier habe ich zuerst an dem Relaunch der Startseite mitgewirkt. Im Detail habe ich hier hauptsächlich an der Umsetzung des großen \"Hero\" Bereichs gearbeitet und auch bei der Gestaltung der neuen Marketing Werbemittel ausgeholfen.",
      "1": "Als ein kleines Nebenprojekt wurde mir die komplette Überarbeitung der \"Refinement Filter\" auf der Produktkategorie- oder Produktsuche-Seite für mobile Geräte zugeteilt. Hier lag das größte Problem für Nutzer darin, dass die Filter alle in einem Akkordeon untereinander platziert waren und nach jeder Eingabe die Website neu geladen wurde. Um dies zu lösen habe ich die Filter alle in ein Overlay gelegt und jedem Filter eine eigene Ebene/Seite innerhalb des Overlays gegeben. Zusätzlich ist es nun möglich mehrere Filter zusammen auszuwählen.",
      "2": "Ein weiteres sehr interessantes Projekt war der Check-out. Hier habe ich in Zusammenarbeit mit zwei weiteren Kollegen den Bestellprozess komplett überdacht und neugestaltet. Hier lagen die Probleme für den Kunden darin, dass die Adresseingabe sowie die Pflicht zur Registration unübersichtlich waren und schließlich den versteckte Kaufen-Button zu finden. In der aktuellen Version sind all diese Probleme behandelt, indem wir einen deutlichen Schritt mit einer Anmeldung/Registrierung vor die Adresseingabe gelegt haben. Außerdem legten wir den Kaufen-Button unter die Bezahlmethoden, anstelle ihn an jede Bezahlmethode zu knüpfen, innerhalb eines Akkordeon-Panels."
    },
    "list": {
      "0": "Konzepte für neue Prozesse und Komponenten",
      "1": "Wireframes von Layouts und Komponeten",
      "2": "Mockups von Layouts und Komponenten",
      "3": "HTML/CSS Prototypen für die Entwicklung"
    },
    "link": "https://real.de",
    "images": [{
        "src": "images/dp_real1.png"
      },
      {
        "src": "images/dp_real2.png"
      },
      {
        "src": "images/dp_real3.png"
      }
    ]
  },
  "dProject2": {
    "title": "REWE Foto",
    "text": {
      "0": "REWE Foto ist ein Projekt, welches auf der White-Label Lösung der Picanova Group beruht. Über diesem Shop ist es dem Nutzer möglich diverse personalisierte Deko- und Lifestyle-Produkte zu bestellen. Der Nutzer kann ein eigenes Foto hochladen und es auf die Produkte drucken lassen sowie weiterhin mit Texten und Grafiken personalisieren. Meine Aufgaben lagen zuerst bei der kompletten Gestaltung der UI und der Werbemittel unter der Beachtung der REWE Group CI.",
      "1": "Nach dem Launch des Shops habe ich fortlaufend die Monatlichen und Wöchentlich Werbemittel für alle digitalen und Print-Channel gestaltet. Dies waren unter anderem Landingpages, Newsletter, Print-Anzeigen etc.",
      "2": "Nach gut einem Jahr wurde mir die komplette Verantwortung über dieses Projekt übertragen. Somit erweiterte sich mein Aufgabenbereich um die allgemeine Projektleitung, die Konzeption der Marketing-Maßnahmen sowie dem Reporting über den Erfolg des Shops an die REWE Group erweitert."
    },
    "list": {
      "0": "Gestaltung des Webshops unter Beachtung der CI",
      "1": "Umsetzug von Werbemittel für alle Channel",
      "2": "Projektleitung und Marketing"
    },
    "link": "https://www.foto.rewe.de",
    "images": [{
        "src": "images/dp_rf1.png"
      },
      {
        "src": "images/dp_rf2.png"
      },
      {
        "src": "images/dp_rf3.png"
      }
    ]
  },
  "dProject3": {
    "title": "Der Moment",
    "text": {
      "0": "\"DER Moment\" war eine App mit denen Nutzer sich während ihrer Reise eine Reisefotobuch zusammenstellen, sowie Postkarten versenden konnten. Hierzu nahm der Nutzer Fotos auf seiner Reise auf und konnte noch unterwegs sich ein Fotobuch zusammenstellen, nach Hause bestellen und eine Postkarte an Freunde & Familie schicken.",
      "1": "Ich übernahm bei diesem Projekt vornehmlich die Konzeption der UX und den User-Flow durch die App. Weiter erstellte ich Wireframes und Mockups für die Entwicklung.",
      "2": "Abschließend führte ich diverse Test für UX, Performance und Gerätekompatibilität aus bevor die App auf den Markt ging. Leider wurde diese App inzwischen wieder vom Markt genommen."
    },
    "list": {
      "0": "Konzeption der UX und User-Flows",
      "1": "Gestaltung von Wireframes und Mockups",
      "2": "Quality Assurence"
    },
    "link": "",
    "images": [{
        "src": "images/dp_mo1.png"
      },
      {
        "src": "images/dp_mo2.png"
      },
      {
        "src": "images/dp_mo3.png"
      }
    ]
  },
  "dProject4": {
    "title": "meinfoto.de Website",
    "text": {
      "0": "\"meinfoto.de\" ist die Hauptmarke der Picanova Group. Über diesem Shop ist es dem Nutzer möglich diverse personalisierte Deko- und Lifestyle-Produkte zu bestellen. Der Nutzer kann ein eigenes Foto hochladen und es auf die Produkte drucken lassen sowie weiterhin mit Texten und Grafiken personalisieren. Für diese Marke sollte ich eine responsive Lösung gestalten.",
      "1": "Für diese Aufgabe gestaltete ich einige Komponenten neu und erstellte detaillierte Mockups für diverse Viewports. Für die Entwicklung des neuen Frontends wurde eine Agentur beauftragt für die ich als zusätzlicher Ansprechpartner bei der Umsetzung des Designs zur Seite stand.",
      "2": "Außerdem wurde ich während der Entwicklung des Frontends damit beauftragt neue Produktfotos anzufertigen, um daraus wiederverwendbare Mockups für die Werbemittelgestaltung zu erstellen. Hierzu ließ ich Musterprodukte in der Produktion anfertigen und stellte mithilfe eines Kollegen ein Fotostudio zusammen. Nach den Shootings übernahm ich die Fotobearbeitung und erstellte aus den Fotos Photoshop Dateien, die entweder mit Smartobjekten und Masken arbeiten oder eine Photoshop Action laufen ließen."
    },
    "list": {
      "0": "Gestaltung von Komponeten",
      "1": "Responsive Layout Mockups",
      "2": "Produktfotos Shooting/Bearbeitung",
      "3": "Photoshop Produkt Mockups"
    },
    "link": "#",
    "images": [{
        "src": "images/dp_mf1.png"
      },
      {
        "src": "images/dp_mf2.png"
      },
      {
        "src": "images/dp_mf3.png"
      }
    ]
  },
  "codeTools": [{
      "src": "images/html5.png",
      "title": "HTML"
    },
    {
      "src": "images/sass.png",
      "title": "Sass"
    },
    {
      "src": "images/vue.png",
      "title": "Vue.js"
    },
    {
      "src": "images/js.png",
      "title": "JavaScript"
    }
  ],
  "codeFamiliar": [{
      "src": "images/wp.png",
      "title": "Wordpress"
    },
    {
      "src": "images/jquery.png",
      "title": "jQuery"
    },
    {
      "src": "images/gitlab.png",
      "title": "GitLab"
    },
    {
      "src": "images/jira.png",
      "title": "Jira"
    }
  ],
  "codeSkills1": {
    "0": "Single Page Applications (vue)",
    "1": "Entwicklung von Komponenten (vue)",
    "2": "Pattern Librarys",
    "3": "Statische Prototypen"
  },
  "codeSkills2": {
    "0": "Responsive Layouts",
    "1": "Styleguides"
  },
  "cCanDo1": {
    "0": "Wordpress Themes",
    "1": "Landingpages",
    "2": "Newsletter"
  },
  "cCanDo2": {

  },
  "codeProjects": [{
      "src": "images/real.png",
      "title": "real.de",
      "project": "cProject1"
    },
    {
      "src": "images/rf.png",
      "title": "REWE Foto",
      "project": "cProject2"
    },
    {
      "src": "images/mf.png",
      "title": "meinfoto.de",
      "project": "cProject3"
    }
  ],
  "cProject1": {
    "title": "real.de",
    "text": {
      "0": "Die real.de Website besteht aus vier verschiedenen Services. Meine Aufgaben bezogen sich innerhalb dieses Projektes auf den Marktplatz.",
      "1": "Eine meiner ersten Aufgaben in der Frontend-Abteilung war das legen eines Grundsteins für eine \"Pattern Library\". Hierzu recherchierte ich verschiedene Systeme und Herangehensweisen, um eine Pattern Library in das bestehende Projekt zu integrieren. Infolgedessen wurde ein Team gegründet, welches sich um die Umsetzung der Patter Library kümmert.",
      "2": "Eine weitere Aufgabe bestand darin, die Kundenkonto-Bereich des Marktplatzes neu zu entwickeln. Für das Projekt wurde Vue.js als Frontend-Framework gewählt. Für die Umsetzung übernahm ich die Entwicklung verschiedene einzelner Komponenten und fügte diese zu einige Verschiedenen Ansichten des Kundenkonto-Bereichs zusammen.",
      "3": "Die genutzten Technologien waren unteranderem: Vue.js, SASS, vuex + graphQL"
    },
    "list": {
      "0": "Pattern Librarys",
      "1": "Vue.js Komponenten",
      "2": "Vue.js Layouts"
    },
    "link": "#",
    "images": [{
        "src": "images/dp_real1.png"
      },
      {
        "src": "images/dp_real2.png"
      },
      {
        "src": "images/dp_real3.png"
      }
    ]
  },
  "cProject2": {
    "title": "REWE Foto",
    "text": {
      "0": "REWE Foto ist ein Projekt, welches auf der White-Label Lösung der Picanova Group beruht. Über diesem Shop ist es dem Nutzer möglich diverse personalisierte Deko- und Lifestyle-Produkte zu bestellen. Der Nutzer kann ein eigenes Foto hochladen und es auf die Produkte drucken lassen sowie weiterhin mit Texten und Grafiken personalisieren. Für den Launch des Shops war es meine Aufgabe das Frontend zu gestalten.",
      "1": "Die Shops der Picanova Group nutzen für das Frontend ein eigens entwickeltes Template für das ebenso eigens entwickeltes Backend. Dieses Template musste ich an die CI der REWE Group anpassen und an das Backend anknüpfen. Außerdem musste ich den Content wie, Texte und Grafiken, in den Shop einpflegen.",
      "2": "Die genutzten Technologien waren unteranderem: Primefaces, jQuery, XHTML, CSS3"
    },
    "list": {
      "0": "Anpassungen in xhtml und css3",
      "1": "Verknüpfung des Backends mit dem Frontend",
      "2": "Einpflegen des Contents"
    },
    "link": "https://foto.rewe.de",
    "images": [{
        "src": "images/dp_rf1.png"
      },
      {
        "src": "images/dp_rf2.png"
      },
      {
        "src": "images/dp_rf3.png"
      }
    ]
  },
  "cProject3": {
    "title": "meinfoto.de",
    "text": {
      "0": "\"meinfoto.de\" ist die Hauptmarke der Picanova Group. Über diesem Shop ist es dem Nutzer möglich diverse personalisierte Deko- und Lifestyle-Produkte zu bestellen. Der Nutzer kann ein eigenes Foto hochladen und es auf die Produkte drucken lassen sowie weiterhin mit Texten und Grafiken personalisieren. Für diese sollte ich diverse Landingpages entwickeln.",
      "1": "Diese Landingpages waren Teil unterschiedlichster Werbekampagnen und erforderte verschiedenste Zusammenstellungen an Komponenten. Es sollten hauptsächlich Landingpages für reduzierte Artikel sein, die Hauptsächlich aus einem CTA, Slideshow, Preistabellen und Text bestand. Hin und wieder waren aber auch komplexere Formulare einzupflegen oder andere Komponenten wie ein Menu zur Vorauswahl bestimmter Produkteigenschaften, die dann zu einem vordefinierten Produkt Konfigurator führten.",
      "2": "Die genutzten Technologien waren unteranderem: Primefaces, jQuery, XHTML, CSS3"
    },
    "list": {
      "0": "Umsetzung von Landingpages",
      "1": "Umsetzung komplexer Komponenten"
    },
    "link": "https://meinfoto.de",
    "images": [{
        "src": "images/dp_mf1.png"
      },
      {
        "src": "images/dp_mf2.png"
      },
      {
        "src": "images/dp_mf3.png"
      }
    ]
  },
  "contact": [{
      "src": "images/xing.png",
      "title": "Xing",
      "link": "https://www.xing.com/profile/Christian_Gumbert/cv",
      "target": "_blank"
    },
    {
      "src": "images/linkedin.png",
      "title": "linkedIn",
      "link": "https://www.linkedin.com/in/christian-gumbert-ab4483110",
      "target": "_blank"
    },
    {
      "src": "images/mail.png",
      "title": "E-Mail",
      "link": "mailto:cgumbert@gmx.net",
      "target": "_top"
    }
  ],
  "companys": [{
      "src": "images/picanova.png",
      "title": "Picanova GmbH",
      "link": "https://company.picanova.com/",
      "target": "_blank"
    },
    {
      "src": "images/realdigital.png",
      "title": "real.digital",
      "link": "https://www.real-digital.de/",
      "target": "_blank"
    }
  ]
}